package com.jkay.task.level01.task03;

/*
Объявляем переменные

В Java нельзя просто так взять — и использовать переменную!
Вас не поймут (компиляторы не поймут, ругаться будут, вот увидите!).
Так что если уж вы решились что-то делать с переменной, об этом намерении нужно объявить во всеуслышание!
Пишем программу, которая объявляет переменные типов int и String.
*/

public class Solution {
    public static void main(String[] args) {
        String name;
        String city;
        int age;
    }
}
