package com.jkay.task.level01.task02;

/*
Я думаю, быть программистом - это круто

Если вы считаете, что быть программистом — не круто, значит, вы ещё не пробовали им быть.
Самое время попробовать и написать первую программу.
Выведите (с помощью команды вывода на экран) фразу,
которую один выпускник JavaRush некогда выцарапал на корпусе своего космического корабля:
Я думаю, быть программистом - это круто
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Я думаю, быть программистом - это круто");
    }
}
